Revit 2024 API
WallSweepType Enumeration
 Represents the possible types for methods affecting wall sweeps or reveals.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum WallSweepType
Visual Basic
Public Enumeration WallSweepType
Visual C++
public enum class WallSweepType
Members
Member name | Description
Sweep |  Represents a wall sweep.
Reveal |  Represents a reveal.
See Also
Autodesk.Revit.DB Namespace